USE hospital;
CREATE TABLE 의사(
번호			INTEGER			NOT NULL,
이름			VARCHAR(20)		NOT NULL, 
주민등록번호	VARCHAR(15)		NOT NULL,
성별			CHAR(1)			NULL,
주소			VARCHAR(120)	NOT NULL,
전화번호		VARCHAR(15)		NOT NULL,
출신학교		VARCHAR(20)		NOT NULL,
분야			VARCHAR(10)		NOT NULL,
PRIMARY KEY(번호)
);


CREATE TABLE 환자(
번호			INTEGER			NOT NULL,
이름			VARCHAR(20)		NOT NULL,
주민등록번호	VARCHAR(15)		NOT NULL,
성별			CHAR(1)			NULL,
주소			VARCHAR(120)	NOT NULL,
전화번호		VARCHAR(15)		NOT NULL,
PRIMARY KEY(번호)
);


CREATE TABLE 직원(
번호			INTEGER			NOT NULL,
이름			VARCHAR(20)		NOT NULL,
성별			CHAR(1)			NULL,
주민등록번호	VARCHAR(15)		NOT NULL,
주소			VARCHAR(120)	NOT NULL,
담당부서		VARCHAR(10)		NOT NULL,
PRIMARY KEY(번호)
);


CREATE TABLE 진료(
번호			INTEGER			NOT NULL,
환자번호		INTEGER			NOT NULL,
의사번호		INTEGER			NOT NULL,
내용			VARCHAR(500)	NOT NULL,
일자			DATE			NOT NULL,
PRIMARY KEY(번호),
FOREIGN KEY(환자번호) REFERENCES 환자(번호),
FOREIGN KEY(의사번호) REFERENCES 의사(번호)
);


CREATE TABLE 차트(
번호			INTEGER		NOT NULL,
진료번호		INTEGER		NOT NULL,
의사번호		INTEGER		NOT NULL,
환자번호		INTEGER		NOT NULL,
직원번호		INTEGER		NOT NULL,
차트위치		VARCHAR(50)	NOT NULL,
PRIMARY KEY(번호),
FOREIGN KEY(진료번호) REFERENCES 진료(번호),
FOREIGN KEY(의사번호) REFERENCES 의사(번호),
FOREIGN KEY(환자번호) REFERENCES 환자(번호),
FOREIGN KEY(직원번호) REFERENCES 직원(번호)
);


CREATE TABLE 제약회사(
번호			INTEGER			NOT NULL,
이름			VARCHAR(30)		NOT NULL,
전화번호		VARCHAR(15)		NOT NULL,
주소			VARCHAR(120)	NOT NULL,
PRIMARY KEY(번호)
);

CREATE TABLE 약(
번호			INTEGER			NOT NULL,
진료번호		INTEGER			NOT NULL,
의사번호		INTEGER			NOT NULL,
환자번호		INTEGER			NOT NULL,
이름			VARCHAR(50)		NOT NULL,
용도			VARCHAR(500)	NOT NULL,
금액			VARCHAR(20)		NOT NULL,
제약회사이름	VARCHAR(30)		NOT NULL,
PRIMARY KEY(번호),
FOREIGN KEY(진료번호) REFERENCES 진료(번호),
FOREIGN KEY(의사번호) REFERENCES 의사(번호),
FOREIGN KEY(환자번호) REFERENCES 환자(번호)
);


CREATE TABLE 수술(
번호			INTEGER		NOT NULL,
진료번호		INTEGER		NOT NULL,
의사번호		INTEGER		NOT NULL,
환자번호		INTEGER		NOT NULL,
시작시간		INTEGER		NOT NULL,
시간			INTEGER		NOT NULL,
PRIMARY KEY(번호),
FOREIGN KEY(진료번호) REFERENCES 진료(번호),
FOREIGN KEY(의사번호) REFERENCES 의사(번호),
FOREIGN KEY(환자번호) REFERENCES 환자(번호)
);


CREATE TABLE 입원(
등록번호		INTEGER		NOT NULL,
진료번호		INTEGER		NOT NULL,
의사번호		INTEGER		NOT NULL,
환자번호		INTEGER		NOT NULL,
금액			INTEGER		NOT NULL,
입원일자		DATE		NOT NULL,
퇴원일자		DATE		NOT NULL,
PRIMARY KEY(등록번호),
FOREIGN KEY(진료번호) REFERENCES 진료(번호),
FOREIGN KEY(의사번호) REFERENCES 의사(번호),
FOREIGN KEY(환자번호) REFERENCES 환자(번호)
);


CREATE TABLE 수술실(
번호			INTEGER		NOT NULL,
수술번호		INTEGER		NOT NULL,
분류			VARCHAR(30)	NOT NULL,
PRIMARY KEY(번호),
FOREIGN KEY(수술번호) REFERENCES 수술(번호)
);


CREATE TABLE 병실(
번호			INTEGER			NOT NULL,
입원등록번호	INTEGER			NOT NULL,
분류			VARCHAR(30)		NOT NULL,
1일사용금액		INTEGER			NOT NULL,
수용인원		INTEGER			NOT NULL,
PRIMARY KEY(번호),
FOREIGN KEY(입원등록번호) REFERENCES 입원(등록번호)
);

INSERT INTO 의사 VALUES(1001, '김도영', '031002-3252564', '남', '서울특별시', '010-1524-5425', '연세대', '내과');
INSERT INTO 의사 VALUES(1002, '나성범', '891003-1524474', '남', '서울특별시', '010-5487-5214', '고려대', '정형외과');
INSERT INTO 의사 VALUES(1003, '이창진', '910304-1240052', '남', '부산광역시', '010-2639-9568', '성균관대', '신경외과');
INSERT INTO 의사 VALUES(1004, '양현종', '880301-1685442', '남', '전라남도', '010-4252-5896', '전남대', '안과');
INSERT INTO 의사 VALUES(1005, '박찬호', '950605-1968541', '남', '전라남도', '010-4857-9652', '조선대', '치과');
INSERT INTO 의사 VALUES(1006, '김대유', '910508-2521425', '여', '충청남도', '010-4222-8965', '충남대', '피부과');
INSERT INTO 의사 VALUES(1007, '황동하', '020730-2471542', '여', '충청북도', '010-8965-7412', '충북대', '내과');
INSERT INTO 의사 VALUES(1008, '한승택', '940621-1524898', '남', '서울특별시', '010-4362-2525', '서울대', '신경외과');
INSERT INTO 의사 VALUES(1009, '이범호', '811125-1420087', '남', '부산광역시', '010-7865-5521', '서강대', '치과');
INSERT INTO 의사 VALUES(1010, '김호령', '920430-1965855', '남', '경상남도', '010-4996-5571', '한양대', '피부과');
INSERT INTO 의사 VALUES(1011, '최형우', '831216-1632704', '남', '경상북도', '010-2125-4273', '아주대', '정형외과');
INSERT INTO 의사 VALUES(1012, '최원준', '970323-1908852', '남', '전라북도', '010-7588-2149', '순천향대', '안과');
INSERT INTO 의사 VALUES(1013, '이의리', '020616-4652587', '여', '제주특별자치도', '010-6252-8455', '홍익대', '피부과');
INSERT INTO 의사 VALUES(1014, '이우성', '940717-2034412', '여', '서울특별시', '010-4277-1132', '연세대', '안과');
INSERT INTO 의사 VALUES(1015, '박민', '010605-4971204', '여', '전라북도', '010-8441-1754', '충남대', '내과');
INSERT INTO 의사 VALUES(1016, '홍종표', '000502-3622854', '남', '인천광역시', '010-5411-1655', '전남대', '정형외과');
INSERT INTO 의사 VALUES(1017, '정해영', '010823-4983185', '여', '경기도', '010-2379-9412', '조선대', '치과');
INSERT INTO 의사 VALUES(1018, '장현식', '950224-1974478', '남', '제주특별자치도', '010-4875-2210', '서울대', '내과');
INSERT INTO 의사 VALUES(1019, '임기영', '930416-2008745', '여', '대전광역시', '010-2425-0032', '아주대', '피부과');
INSERT INTO 의사 VALUES(1020, '김사윤', '940608-2896574', '여', '전라남도', '010-3206-6908', '전남대', '내과');
INSERT INTO 의사 VALUES(1021, '서건창', '890822-1552789', '남', '세종특별시', '010-2014-4028', '고려대', '정형외과');
INSERT INTO 의사 VALUES(1022, '김태군', '891230-1747547', '남', '전라북도	', '010-7212-7759', '연세대', '신경외과');
INSERT INTO 의사 VALUES(1023, '곽도규', '040412-3965225', '남', '서울특별시', '010-7282-7537', '순천향대', '피부과');
INSERT INTO 의사 VALUES(1024, '김도현', '000915-4179963', '여', '울산광역시', '010-7853-0695', '충북대', '내과');
INSERT INTO 의사 VALUES(1025, '김건국', '880202-1074541', '남', '광주광역시', '010-8906-6477', '충남대', '피부과');
INSERT INTO 의사 VALUES(1026, '윤영철', '040420-3365252', '남', '광주광역시', '010-4897-7500', '조선대', '치과');
INSERT INTO 의사 VALUES(1027, '이준영', '920810-1308951', '남', '경기도', '010-0477-6852', '전남대', '정형외과');
INSERT INTO 의사 VALUES(1028, '전상현', '960418-1630079', '남', '강원도', '010-7741-1120', '전남대', '내과');
INSERT INTO 의사 VALUES(1029, '한준수', '990213-1994778', '남', '세종특별시', '010-3214-4120', '아주대', '신경외과');
INSERT INTO 의사 VALUES(1030, '최지민', '030910-4312087', '여', '강원도', '010-3032-5523', '한양대', '안과');
	
INSERT INTO 환자 VALUES(10001, '김승일', '950312-1644858', '남', '서울특별시', '010-5654-2152');	
INSERT INTO 환자 VALUES(10002, '류현진', '811224-1978541',	'남', '서울특별시', '010-2147-8547');	
INSERT INTO 환자 VALUES(10003, '문동주', '701106-1637044', '남', '부산광역시', '010-8589-9652');	
INSERT INTO 환자 VALUES(10004, '이승관', '680615-1974201',	'남', '전라남도', '010-8547-8743');	
INSERT INTO 환자 VALUES(10005, '윤대경', '030415-3585697',	'남', '전라남도', '010-8021-5412');	
INSERT INTO 환자 VALUES(10006, '남지민', '121212-3741154',	'남', '충청남도',	'010-0203-5632');	
INSERT INTO 환자 VALUES(10007, '김기중', '060606-3958652',	'남', '충청북도',	'010-4710-8021');	
INSERT INTO 환자 VALUES(10008, '한승혁', '851008-1784520', '남', '서울특별시', '010-5210-8541');	
INSERT INTO 환자 VALUES(10009, '황영묵', '870914-1450185',	'남', '부산광역시', '010-9956-8447');	
INSERT INTO 환자 VALUES(10010, '김다은', '960325-2045124',	'여', '경상남도', '010-4432-6550');	
INSERT INTO 환자 VALUES(10011, '홍다비', '970204-2548514',	'여', '경상북도', '010-8847-7001');	
INSERT INTO 환자 VALUES(10012, '최은지', '101010-4689588',	'여', '전라북도', '010-8220-4022');	
INSERT INTO 환자 VALUES(10013, '김해란', '020328-4829910',	'여', '제주특별자치도', '010-3651-7420');	
INSERT INTO 환자 VALUES(10014, '김나희', '690418-2790616',	'여', '서울특별시',	 '010-7813-6211');	
INSERT INTO 환자 VALUES(10015, '도수빈', '760625-2636513',	'여', '전라북도', '010-8401-1102');	
INSERT INTO 환자 VALUES(10016, '김연경', '021107-4616919',	'여', '인천광역시',	 '010-9661-7006');	
INSERT INTO 환자 VALUES(10017, '김수지', '031223-4685121',	'여', '경기도',' 010-9331-4102');	
INSERT INTO 환자 VALUES(10018, '박현주', '940321-2984151',	'여', '제주특별자치도', '010-9347-8710');	
INSERT INTO 환자 VALUES(10019, '임혜림', '850708-2456152',	'여', '대전광역시',	 '010-5470-9985');	
INSERT INTO 환자 VALUES(10020,' 서채현', '460324-1754203',	'여', '전라남도', '010-5771-8777');	
INSERT INTO 환자 VALUES(10021, '김다솔', '650506-1852215',	'여', '세종특별시',	 '010-9771-4117');	
INSERT INTO 환자 VALUES(10022, '김미연', '150515-4710158',	'여', '전라북도', '010-9930-0221');	
INSERT INTO 환자 VALUES(10023, '장지수', '700623-1810118',	'남', '서울특별시',	 '010-8445-5200');	
INSERT INTO 환자 VALUES(10024, '문현빈', '710710-1637049',	'남', '울산광역시',	 '010-6344-4409');	
INSERT INTO 환자 VALUES(10025, '채은성', '650104-1747071',	'남', '광주광역시',	 '010-8474-7752');	
INSERT INTO 환자 VALUES(10026, '하주석', '500908-1658827',	'남', '광주광역시',	 '010-8010-1000');
INSERT INTO 환자 VALUES(10027, '노시환', '080202-3521102',	'남', '경기도', '010-2344-4107');	
INSERT INTO 환자 VALUES(10028, '최재훈', '021004-3544142',	'남', '강원도', '010-9556-9300');	
INSERT INTO 환자 VALUES(10029, '이주아', '040714-3626515',	'남', '세종특별시',	 '010-6920-0154');	
INSERT INTO 환자 VALUES(10030, '변지수', '910105-1575485',	'남', '울산광역시',	 '010-3320-1102');

INSERT INTO 직원 VALUES(20051, '권보람', '여',	'001021-4845211', '서울특별시', '간호부');
INSERT INTO 직원 VALUES(20052, '김혜인', '여',	'901105-2652520', '세종특별시', '원무부');
INSERT INTO 직원 VALUES(20053, '이다은', '여',	'910716-2303052', '전라북도',	'간호부');
INSERT INTO 직원 VALUES(20054, '박승아', '여',	'741018-2528856', '서울특별시', '원무부');
INSERT INTO 직원 VALUES(20055, '박서현', '여',	'940512-2120032', '울산광역시', '간호부');
INSERT INTO 직원 VALUES(20056, '전정원', '여',	'920312-2896552', '광주광역시', '간호부');
INSERT INTO 직원 VALUES(20057, '송유영', '여',	'840107-2232525', '광주광역시', '간호부');
INSERT INTO 직원 VALUES(20058, '우채윤', '여',	'850326-2411025', '경기도', '원무부');
INSERT INTO 직원 VALUES(20059, '노유영', '여',	'870209-2161312', '강원도', '간호부');
INSERT INTO 직원 VALUES(20060, '전혜빈', '여',	'970814-2323525', '세종특별시', '간호부');
INSERT INTO 직원 VALUES(20061, '우가연', '여',	'940611-2785541', '울산광역시', '간호부');
INSERT INTO 직원 VALUES(20062, '조서현', '여',	'980220-2236252', '전라남도', '원무부');
INSERT INTO 직원 VALUES(20064, '문다빈', '여',	'741020-2799658', '강원도', '간호부');
INSERT INTO 직원 VALUES(20065, '김은수', '여',	'990814-2236131', '서울특별시', '원무부');
INSERT INTO 직원 VALUES(20066, '임에스더', '여', '980521-2032269', '경기도', '간호부');
INSERT INTO 직원 VALUES(20067, '김유진', '여',	'000316-4620889', '전라남도', '원무부');
INSERT INTO 직원 VALUES(20068, '이사야', '여',	'960524-2335258', '전라북도', '원무부');
INSERT INTO 직원 VALUES(20069, '김건우', '남',	'970803-1332020', '충청남도',	'간호부');
INSERT INTO 직원 VALUES(20070, '김석우', '남',	'960326-1669525', '충청북도',	'간호부');
INSERT INTO 직원 VALUES(20071, '김동민', '남',	'950105-1774520', '충청남도',	'간호부');
INSERT INTO 직원 VALUES(20072, '이호연', '남',	'940108-1774545', '전라북도',	'간호부');
INSERT INTO 직원 VALUES(20073, '이찬민', '남',	'930607-1141420', '경기도', '간호부');
INSERT INTO 직원 VALUES(20074, '권영준', '남',	'920409-1169974', '서울특별시', '간호부');
INSERT INTO 직원 VALUES(20075, '김준환', '남',	'910913-1102265', '울산광역시', '원무부');
INSERT INTO 직원 VALUES(20076, '김민혁', '남',	'900521-1104447', '부산광역시', '원무부');
INSERT INTO 직원 VALUES(20077, '배호열', '남',	'890719-1445211', '전라남도', '원무부');
INSERT INTO 직원 VALUES(20078, '김진규', '남',	'880730-1169945', '경상남도',	'간호부');
INSERT INTO 직원 VALUES(20079, '김준석', '남',	'870228-1812245', '경상북도',	'원무부');
INSERT INTO 직원 VALUES(20080, '박상현', '남',	'860819-1300205', '인천광역시', '원무부');

INSERT INTO 제약회사 VALUES(545, '영풍제약', '032-812-8356', '인천광역시 남동구 함박뫼로 333');
INSERT INTO 제약회사 VALUES(546, '이연제약', '02-793-5557', '서울특별시 강남구 테헤란로 620 에이동 12층');
INSERT INTO 제약회사 VALUES(547, '한국파마', '02-558-1277', '서울 강남구 테헤란로4길 14, 미림타워 8F');
INSERT INTO 제약회사 VALUES(548, '한국휴텍스제약', '031-3777-7900', '경기도 화성시 삼성1로 344');
INSERT INTO 제약회사 VALUES(549, '국제약품', '031-781-9081', '경기도 안산시 단원구 산성로 47');
INSERT INTO 제약회사 VALUES(550, '한미약품', '02-410-9114', '서울특별시 송파구 위례성대로 14');
INSERT INTO 제약회사 VALUES(551, '한국알콘', '02-2007-5000', '서울특별시 강남구 테헤란로 534, 글라스타워 6층');
INSERT INTO 제약회사 VALUES(552, '대화제약', '02-586-6451', '서울특별시 서초구 남부순환로 2145');

INSERT INTO 약 VALUES(100, '가나릴정', '복부팽만, 상복부통, 식욕부진, 속쓰림, 구역, 구토', '92원/1정', '영풍제약');
INSERT INTO 약 VALUES(101, '가나모티정', '속쓰림, 구역, 구토', '103원/1정', '이연제약');
INSERT INTO 약 VALUES(102, '가나슨캡슐', '만성지속성 간염', '221원/1캡슐', '한국파마');
INSERT INTO 약 VALUES(103, '가네리드정', '성인의 만성 B형 간염', '3,033원/1정', '한국휴텍스제약');
INSERT INTO 약 VALUES(104, '국제히알우론산아이주', '백내장수술, 각막이식수술, 녹내장수술', '25,006원/0.85ml', '국제약품');
INSERT INTO 약 VALUES(105, '도티몰점안액5ml', '개방각 녹내장 환자의 증가된 안압 감소', '11,790원/5ml', '한미약품');
INSERT INTO 약 VALUES(106, '듀라티얼즈안연고', '건성 각막염, 수술 후 윤활제', '2,412원/3.5g', '한국알콘');
INSERT INTO 약 VALUES(107, '디피메토론점안액', '외안부 및 전안부의 염증성 질환', '2,122원/6ml', '대화제약');
INSERT INTO 약 VALUES(108, '구루메포민정500mg', '제2형 당뇨병 환자의 치료', '64원/정', '영풍제약');
INSERT INTO 약 VALUES(109, '노바크정5mg', '고혈압, 관상동맥의 고정패쇄, 심근성허혈증', '312원/1정', '영풍제약');
INSERT INTO 약 VALUES(110, '녹사펜정', '소염, 진통, 만성 류마티스관절염, 골관절염, 요통', '125원/1정', '영풍제약');
INSERT INTO 약 VALUES(111, '가벤틴캡슐300mg', '뇌전증', '198원/1정', '이연제약');
INSERT INTO 약 VALUES(112, '네오베트정10mg', '위궤양, 십이지장궤양', '454원/1정', '이연제약');
INSERT INTO 약 VALUES(113, '두푸라민주', '심근경색, 외상, 내독성패혈증', '1,708원/5ml', '이연제약');
INSERT INTO 약 VALUES(114, '셀브캡슐200mg', '골관절염, 류마티스관절염, 강직척추염', '443원/1캡슐', '이연제약');
INSERT INTO 약 VALUES(115, '아토맥스크림0.05%', '코르티코스테로이드제에 반응하는 피부질환의 가려움 및 염증의 경감', '2,848원/30g', '한국 파마');
INSERT INTO 약 VALUES(116, '진맥톤정80mg', '말초동맥순환장애, 어지러움, 혈관성 및 퇴행성 이명', '99원/1정', '한국파마');
INSERT INTO 약 VALUES(117, '크로슬액', '두부의 피부질환(습진, 피부염군, 건선)', '2,750원/50ml', '한국파마');
INSERT INTO 약 VALUES(118, '파마메코발라민정', '말초성 신경장애', '50원/1정', '한국파마');
INSERT INTO 약 VALUES(119, '락시러스캡슐', '장염, 설사, 급성이질', '127원/1캡슐', '한국휴텍스제약');
INSERT INTO 약 VALUES(120, '뷰티네일라카', '피부사상균, 효모균 및 곰팡이에 의한 조갑진균증', '23,190원/5ml', '한국휴텍스제약');
INSERT INTO 약 VALUES(121, '쎄파실캡슐', '연쇄구균, 폐렴연쇄구균, 임균, 기관지염, 신우신염, 담낭염, 중이염', '428원/1캡슐', '한국휴텍스제약');
INSERT INTO 약 VALUES(122, '아이소펜시럽', '급성 상기도 감염으로 인한 발열시 해열', '29원/500ml', '한국휴텍스제약');
INSERT INTO 약 VALUES(123, '넥시프라정20ml', '위식도 역류질환, 미란성 역류식도염의 치료', '649원/1정', '국제약품');
INSERT INTO 약 VALUES(124, '라비나크림15g', '피부사상균에 의한 피부진균감염증, 족부백선, 고부백선, 체부백선, 피부칸디다증', '1,686원/15g', '국제약품');
INSERT INTO 약 VALUES(125, '실레탈서방캡슐200mg', '만성동맥폐색증에 따른 궤양, 동통 및 냉감 등 허혈성 제증상의 개선, 뇌경생 발증 후 재발억제', '889원/1캡슐', '국제약품');
INSERT INTO 약 VALUES(126, '케모신건조시럽125mg/5ml', '유효균종, 폐렴연쇄구균, 인플루엔자균, 포도구균, 적응증, 중이염', '53원/150ml', '국제약품');
INSERT INTO 약 VALUES(127, '로수젯정10/2.5mg', '원발성 고콜레스테롤혈증', '738원/1정', '한미약품');
INSERT INTO 약 VALUES(128, '마이코놀캡슐250mg', '동종 신장, 심장, 간장 이식환자에 대한 급성 장기 거부반응 방지', '967원/1캡슐', '한미약품');
INSERT INTO 약 VALUES(129, '맥시부펜이알정300mg', '만성 다발성 관절염, 류마티스관절염, 관절증, 염증, 통증 및 발열을 수반하는 감염증의 치료보조', '111원/1정', '한미약품');
INSERT INTO 약 VALUES(130, '후루오레사이트주사10%', '혈관조영, 혈관검사 등의 진단용', '5,731원/5ml', '한국알콘');
INSERT INTO 약 VALUES(131, '티얼즈내츄럴프리점안액(1회용)', '백내장 수술, 각막이식수술, 녹내장수술 등 각종 안과수술 보조제', '30,389원/0.85ml', '한국알콘');
INSERT INTO 약 VALUES(132, '테리락스엑스엘서방정', '안정, 물리적 요법 및 근골격의 급성 통증상태 완화의 보조', '116원/1정', '대화제약');
INSERT INTO 약 VALUES(133, '팜비스정', '대상포진 바이러스 감염증, 생식기포진 감염증의 치료 및 재발성 생식기포진의 억제', '3,270원1회', '대화제약');
INSERT INTO 약 VALUES(133, '유디온캡슐', '지속적으로 SGPT가 상승되어 있는 만성지속성 간염', '221원1캡슐', '대화제약');

